Autodesk.Revit.UI.Result
Informs Autodesk Revit of the status of your application after execution.

Autodesk.Revit.UI.Result.Cancelled
Signifies that the external application is cancelled.

Autodesk.Revit.UI.Result.Succeeded
The external application completed successfully. Autodesk Revit will keep this object
during the entire Revit session.

Autodesk.Revit.UI.Result.Failed
The external application was unable to complete its task.